Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk100.h
#define _IEC5_CAN4IE_POSITION                    0x0000001C
#define _IEC5_CAN4IE_MASK                        0x10000000
#define _IEC5_CAN4IE_LENGTH                      0x00000001

#define _IEC5_QEI3IE_POSITION                    0x0000001D
#define _IEC5_QEI3IE_MASK                        0x20000000
#define _IEC5_QEI3IE_LENGTH                      0x00000001

#define _IEC5_QEI4IE_POSITION                    0x0000001E
#define _IEC5_QEI4IE_MASK                        0x40000000
#define _IEC5_QEI4IE_LENGTH                      0x00000001

#define _IEC5_QEI5IE_POSITION                    0x0000001F
#define _IEC5_QEI5IE_MASK                        0x80000000
#define _IEC5_QEI5IE_LENGTH                      0x00000001

#define _IEC5_w_POSITION                         0x00000000
#define _IEC5_w_MASK                             0xFFFFFFFF
#define _IEC5_w_LENGTH                           0x00000020

#define _IEC6_QEI6IE_POSITION                    0x00000000
#define _IEC6_QEI6IE_MASK                        0x00000001
#define _IEC6_QEI6IE_LENGTH                      0x00000001

#define _IEC6_I2C4BIE_POSITION                   0x00000002
#define _IEC6_I2C4BIE_MASK                       0x00000004
#define _IEC6_I2C4BIE_LENGTH                     0x00000001

#define _IEC6_I2C4SIE_POSITION                   0x00000003
#define _IEC6_I2C4SIE_MASK                       0x00000008
#define _IEC6_I2C4SIE_LENGTH                     0x00000001

#define _IEC6_I2C4MIE_POSITION                   0x00000004
#define _IEC6_I2C4MIE_MASK                       0x00000010
#define _IEC6_I2C4MIE_LENGTH                     0x00000001

#define _IEC6_IC10EIE_POSITION                   0x00000005
#define _IEC6_IC10EIE_MASK                       0x00000020
#define _IEC6_IC10EIE_LENGTH                     0x00000001

#define _IEC6_IC10IE_POSITION                    0x00000006
#define _IEC6_IC10IE_MASK                        0x00000040
#define _IEC6_IC10IE_LENGTH                      0x00000001

#define _IEC6_OC10IE_POSITION                    0x00000007
#define _IEC6_OC10IE_MASK                        0x00000080
#define _IEC6_OC10IE_LENGTH                      0x00000001

#define _IEC6_IC11EIE_POSITION                   0x00000008
#define _IEC6_IC11EIE_MASK                       0x00000100
#define _IEC6_IC11EIE_LENGTH                     0x00000001

#define _IEC6_IC11IE_POSITION                    0x00000009
#define _IEC6_IC11IE_MASK                        0x00000200
#define _IEC6_IC11IE_LENGTH                      0x00000001

#define _IEC6_OC11IE_POSITION                    0x0000000A
#define _IEC6_OC11IE_MASK                        0x00000400
#define _IEC6_OC11IE_LENGTH                      0x00000001

#define _IEC6_IC12EIE_POSITION                   0x0000000B
#define _IEC6_IC12EIE_MASK                       0x00000800
#define _IEC6_IC12EIE_LENGTH                     0x00000001

#define _IEC6_IC12IE_POSITION                    0x0000000C
#define _IEC6_IC12IE_MASK                        0x00001000
#define _IEC6_IC12IE_LENGTH                      0x00000001

#define _IEC6_OC12IE_POSITION                    0x0000000D
#define _IEC6_OC12IE_MASK                        0x00002000
#define _IEC6_OC12IE_LENGTH                      0x00000001

#define _IEC6_IC13EIE_POSITION                   0x0000000E
#define _IEC6_IC13EIE_MASK                       0x00004000
#define _IEC6_IC13EIE_LENGTH                     0x00000001

#define _IEC6_IC13IE_POSITION                    0x0000000F
#define _IEC6_IC13IE_MASK                        0x00008000
#define _IEC6_IC13IE_LENGTH                      0x00000001

#define _IEC6_OC13IE_POSITION                    0x00000010
#define _IEC6_OC13IE_MASK                        0x00010000
#define _IEC6_OC13IE_LENGTH                      0x00000001

#define _IEC6_IC14EIE_POSITION                   0x00000011
#define _IEC6_IC14EIE_MASK                       0x00020000
#define _IEC6_IC14EIE_LENGTH                     0x00000001

#define _IEC6_IC14IE_POSITION                    0x00000012
#define _IEC6_IC14IE_MASK                        0x00040000
#define _IEC6_IC14IE_LENGTH                      0x00000001

#define _IEC6_OC14IE_POSITION                    0x00000013
#define _IEC6_OC14IE_MASK                        0x00080000
#define _IEC6_OC14IE_LENGTH                      0x00000001

#define _IEC6_IC15EIE_POSITION                   0x00000014
#define _IEC6_IC15EIE_MASK                       0x00100000
#define _IEC6_IC15EIE_LENGTH                     0x00000001

#define _IEC6_IC15IE_POSITION                    0x00000015
#define _IEC6_IC15IE_MASK                        0x00200000
#define _IEC6_IC15IE_LENGTH                      0x00000001

#define _IEC6_OC15IE_POSITION                    0x00000016
#define _IEC6_OC15IE_MASK                        0x00400000
#define _IEC6_OC15IE_LENGTH                      0x00000001

#define _IEC6_IC16EIE_POSITION                   0x00000017
#define _IEC6_IC16EIE_MASK                       0x00800000
#define _IEC6_IC16EIE_LENGTH                     0x00000001

#define _IEC6_IC16IE_POSITION                    0x00000018
#define _IEC6_IC16IE_MASK                        0x01000000
#define _IEC6_IC16IE_LENGTH                      0x00000001

#define _IEC6_OC16IE_POSITION                    0x00000019
#define _IEC6_OC16IE_MASK                        0x02000000
#define _IEC6_OC16IE_LENGTH                      0x00000001

#define _IEC6_SPI3EIE_POSITION                   0x0000001A
#define _IEC6_SPI3EIE_MASK                       0x04000000
#define _IEC6_SPI3EIE_LENGTH                     0x00000001

#define _IEC6_SPI3RXIE_POSITION                  0x0000001B
#define _IEC6_SPI3RXIE_MASK                      0x08000000
#define _IEC6_SPI3RXIE_LENGTH                    0x00000001

#define _IEC6_SPI3TXIE_POSITION                  0x0000001C
#define _IEC6_SPI3TXIE_MASK                      0x10000000
#define _IEC6_SPI3TXIE_LENGTH                    0x00000001

#define _IEC6_SPI4EIE_POSITION                   0x0000001D
#define _IEC6_SPI4EIE_MASK                       0x20000000
#define _IEC6_SPI4EIE_LENGTH                     0x00000001

#define _IEC6_SPI4RXIE_POSITION                  0x0000001E
#define _IEC6_SPI4RXIE_MASK                      0x40000000
#define _IEC6_SPI4RXIE_LENGTH                    0x00000001

