Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk100.h
#define _IPC30_w_POSITION                        0x00000000
#define _IPC30_w_MASK                            0xFFFFFFFF
#define _IPC30_w_LENGTH                          0x00000020

#define _IPC31_AD1D18IS_POSITION                 0x00000000
#define _IPC31_AD1D18IS_MASK                     0x00000003
#define _IPC31_AD1D18IS_LENGTH                   0x00000002

#define _IPC31_AD1D18IP_POSITION                 0x00000002
#define _IPC31_AD1D18IP_MASK                     0x0000001C
#define _IPC31_AD1D18IP_LENGTH                   0x00000003

#define _IPC31_AD1D19IS_POSITION                 0x00000008
#define _IPC31_AD1D19IS_MASK                     0x00000300
#define _IPC31_AD1D19IS_LENGTH                   0x00000002

#define _IPC31_AD1D19IP_POSITION                 0x0000000A
#define _IPC31_AD1D19IP_MASK                     0x00001C00
#define _IPC31_AD1D19IP_LENGTH                   0x00000003

#define _IPC31_AD1D20IS_POSITION                 0x00000010
#define _IPC31_AD1D20IS_MASK                     0x00030000
#define _IPC31_AD1D20IS_LENGTH                   0x00000002

#define _IPC31_AD1D20IP_POSITION                 0x00000012
#define _IPC31_AD1D20IP_MASK                     0x001C0000
#define _IPC31_AD1D20IP_LENGTH                   0x00000003

#define _IPC31_AD1D21IS_POSITION                 0x00000018
#define _IPC31_AD1D21IS_MASK                     0x03000000
#define _IPC31_AD1D21IS_LENGTH                   0x00000002

#define _IPC31_AD1D21IP_POSITION                 0x0000001A
#define _IPC31_AD1D21IP_MASK                     0x1C000000
#define _IPC31_AD1D21IP_LENGTH                   0x00000003

#define _IPC31_w_POSITION                        0x00000000
#define _IPC31_w_MASK                            0xFFFFFFFF
#define _IPC31_w_LENGTH                          0x00000020

#define _IPC32_AD1D22IS_POSITION                 0x00000000
#define _IPC32_AD1D22IS_MASK                     0x00000003
#define _IPC32_AD1D22IS_LENGTH                   0x00000002

#define _IPC32_AD1D22IP_POSITION                 0x00000002
#define _IPC32_AD1D22IP_MASK                     0x0000001C
#define _IPC32_AD1D22IP_LENGTH                   0x00000003

#define _IPC32_AD1D23IS_POSITION                 0x00000008
#define _IPC32_AD1D23IS_MASK                     0x00000300
#define _IPC32_AD1D23IS_LENGTH                   0x00000002

#define _IPC32_AD1D23IP_POSITION                 0x0000000A
#define _IPC32_AD1D23IP_MASK                     0x00001C00
#define _IPC32_AD1D23IP_LENGTH                   0x00000003

#define _IPC32_AD1D24IS_POSITION                 0x00000010
#define _IPC32_AD1D24IS_MASK                     0x00030000
#define _IPC32_AD1D24IS_LENGTH                   0x00000002

#define _IPC32_AD1D24IP_POSITION                 0x00000012
#define _IPC32_AD1D24IP_MASK                     0x001C0000
#define _IPC32_AD1D24IP_LENGTH                   0x00000003

#define _IPC32_AD1D25IS_POSITION                 0x00000018
#define _IPC32_AD1D25IS_MASK                     0x03000000
#define _IPC32_AD1D25IS_LENGTH                   0x00000002

#define _IPC32_AD1D25IP_POSITION                 0x0000001A
#define _IPC32_AD1D25IP_MASK                     0x1C000000
#define _IPC32_AD1D25IP_LENGTH                   0x00000003

#define _IPC32_w_POSITION                        0x00000000
#define _IPC32_w_MASK                            0xFFFFFFFF
#define _IPC32_w_LENGTH                          0x00000020

#define _IPC33_AD1D26IS_POSITION                 0x00000000
#define _IPC33_AD1D26IS_MASK                     0x00000003
#define _IPC33_AD1D26IS_LENGTH                   0x00000002

#define _IPC33_AD1D26IP_POSITION                 0x00000002
#define _IPC33_AD1D26IP_MASK                     0x0000001C
#define _IPC33_AD1D26IP_LENGTH                   0x00000003

#define _IPC33_AD1D27IS_POSITION                 0x00000008
#define _IPC33_AD1D27IS_MASK                     0x00000300
#define _IPC33_AD1D27IS_LENGTH                   0x00000002

#define _IPC33_AD1D27IP_POSITION                 0x0000000A
#define _IPC33_AD1D27IP_MASK                     0x00001C00
#define _IPC33_AD1D27IP_LENGTH                   0x00000003

#define _IPC33_w_POSITION                        0x00000000
#define _IPC33_w_MASK                            0xFFFFFFFF
#define _IPC33_w_LENGTH                          0x00000020

#define _IPC34_AD1D33IS_POSITION                 0x00000018
#define _IPC34_AD1D33IS_MASK                     0x03000000
#define _IPC34_AD1D33IS_LENGTH                   0x00000002

#define _IPC34_AD1D33IP_POSITION                 0x0000001A
#define _IPC34_AD1D33IP_MASK                     0x1C000000
#define _IPC34_AD1D33IP_LENGTH                   0x00000003

#define _IPC34_w_POSITION                        0x00000000
#define _IPC34_w_MASK                            0xFFFFFFFF
#define _IPC34_w_LENGTH                          0x00000020

#define _IPC35_AD1D34IS_POSITION                 0x00000000
#define _IPC35_AD1D34IS_MASK                     0x00000003
#define _IPC35_AD1D34IS_LENGTH                   0x00000002

#define _IPC35_AD1D34IP_POSITION                 0x00000002
#define _IPC35_AD1D34IP_MASK                     0x0000001C
#define _IPC35_AD1D34IP_LENGTH                   0x00000003

#define _IPC35_AD1D35IS_POSITION                 0x00000008
#define _IPC35_AD1D35IS_MASK                     0x00000300
#define _IPC35_AD1D35IS_LENGTH                   0x00000002

#define _IPC35_AD1D35IP_POSITION                 0x0000000A
#define _IPC35_AD1D35IP_MASK                     0x00001C00
#define _IPC35_AD1D35IP_LENGTH                   0x00000003

#define _IPC35_AD1D36IS_POSITION                 0x00000010
#define _IPC35_AD1D36IS_MASK                     0x00030000
#define _IPC35_AD1D36IS_LENGTH                   0x00000002

#define _IPC35_AD1D36IP_POSITION                 0x00000012
#define _IPC35_AD1D36IP_MASK                     0x001C0000
#define _IPC35_AD1D36IP_LENGTH                   0x00000003

#define _IPC35_AD1D37IS_POSITION                 0x00000018
#define _IPC35_AD1D37IS_MASK                     0x03000000
#define _IPC35_AD1D37IS_LENGTH                   0x00000002

