Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk100.h
#define _IPC35_AD1D37IP_POSITION                 0x0000001A
#define _IPC35_AD1D37IP_MASK                     0x1C000000
#define _IPC35_AD1D37IP_LENGTH                   0x00000003

#define _IPC35_w_POSITION                        0x00000000
#define _IPC35_w_MASK                            0xFFFFFFFF
#define _IPC35_w_LENGTH                          0x00000020

#define _IPC36_AD1D38IS_POSITION                 0x00000000
#define _IPC36_AD1D38IS_MASK                     0x00000003
#define _IPC36_AD1D38IS_LENGTH                   0x00000002

#define _IPC36_AD1D38IP_POSITION                 0x00000002
#define _IPC36_AD1D38IP_MASK                     0x0000001C
#define _IPC36_AD1D38IP_LENGTH                   0x00000003

#define _IPC36_AD1D39IS_POSITION                 0x00000008
#define _IPC36_AD1D39IS_MASK                     0x00000300
#define _IPC36_AD1D39IS_LENGTH                   0x00000002

#define _IPC36_AD1D39IP_POSITION                 0x0000000A
#define _IPC36_AD1D39IP_MASK                     0x00001C00
#define _IPC36_AD1D39IP_LENGTH                   0x00000003

#define _IPC36_AD1D40IS_POSITION                 0x00000010
#define _IPC36_AD1D40IS_MASK                     0x00030000
#define _IPC36_AD1D40IS_LENGTH                   0x00000002

#define _IPC36_AD1D40IP_POSITION                 0x00000012
#define _IPC36_AD1D40IP_MASK                     0x001C0000
#define _IPC36_AD1D40IP_LENGTH                   0x00000003

#define _IPC36_AD1D41IS_POSITION                 0x00000018
#define _IPC36_AD1D41IS_MASK                     0x03000000
#define _IPC36_AD1D41IS_LENGTH                   0x00000002

#define _IPC36_AD1D41IP_POSITION                 0x0000001A
#define _IPC36_AD1D41IP_MASK                     0x1C000000
#define _IPC36_AD1D41IP_LENGTH                   0x00000003

#define _IPC36_w_POSITION                        0x00000000
#define _IPC36_w_MASK                            0xFFFFFFFF
#define _IPC36_w_LENGTH                          0x00000020

#define _IPC37_AD1D45IS_POSITION                 0x00000018
#define _IPC37_AD1D45IS_MASK                     0x03000000
#define _IPC37_AD1D45IS_LENGTH                   0x00000002

#define _IPC37_AD1D45IP_POSITION                 0x0000001A
#define _IPC37_AD1D45IP_MASK                     0x1C000000
#define _IPC37_AD1D45IP_LENGTH                   0x00000003

#define _IPC37_w_POSITION                        0x00000000
#define _IPC37_w_MASK                            0xFFFFFFFF
#define _IPC37_w_LENGTH                          0x00000020

#define _IPC38_AD1D46IS_POSITION                 0x00000000
#define _IPC38_AD1D46IS_MASK                     0x00000003
#define _IPC38_AD1D46IS_LENGTH                   0x00000002

#define _IPC38_AD1D46IP_POSITION                 0x00000002
#define _IPC38_AD1D46IP_MASK                     0x0000001C
#define _IPC38_AD1D46IP_LENGTH                   0x00000003

#define _IPC38_AD1D47IS_POSITION                 0x00000008
#define _IPC38_AD1D47IS_MASK                     0x00000300
#define _IPC38_AD1D47IS_LENGTH                   0x00000002

#define _IPC38_AD1D47IP_POSITION                 0x0000000A
#define _IPC38_AD1D47IP_MASK                     0x00001C00
#define _IPC38_AD1D47IP_LENGTH                   0x00000003

#define _IPC38_AD1D48IS_POSITION                 0x00000010
#define _IPC38_AD1D48IS_MASK                     0x00030000
#define _IPC38_AD1D48IS_LENGTH                   0x00000002

#define _IPC38_AD1D48IP_POSITION                 0x00000012
#define _IPC38_AD1D48IP_MASK                     0x001C0000
#define _IPC38_AD1D48IP_LENGTH                   0x00000003

#define _IPC38_AD1D49IS_POSITION                 0x00000018
#define _IPC38_AD1D49IS_MASK                     0x03000000
#define _IPC38_AD1D49IS_LENGTH                   0x00000002

#define _IPC38_AD1D49IP_POSITION                 0x0000001A
#define _IPC38_AD1D49IP_MASK                     0x1C000000
#define _IPC38_AD1D49IP_LENGTH                   0x00000003

#define _IPC38_w_POSITION                        0x00000000
#define _IPC38_w_MASK                            0xFFFFFFFF
#define _IPC38_w_LENGTH                          0x00000020

#define _IPC39_AD1D50IS_POSITION                 0x00000000
#define _IPC39_AD1D50IS_MASK                     0x00000003
#define _IPC39_AD1D50IS_LENGTH                   0x00000002

#define _IPC39_AD1D50IP_POSITION                 0x00000002
#define _IPC39_AD1D50IP_MASK                     0x0000001C
#define _IPC39_AD1D50IP_LENGTH                   0x00000003

#define _IPC39_AD1D51IS_POSITION                 0x00000008
#define _IPC39_AD1D51IS_MASK                     0x00000300
#define _IPC39_AD1D51IS_LENGTH                   0x00000002

#define _IPC39_AD1D51IP_POSITION                 0x0000000A
#define _IPC39_AD1D51IP_MASK                     0x00001C00
#define _IPC39_AD1D51IP_LENGTH                   0x00000003

#define _IPC39_AD1D52IS_POSITION                 0x00000010
#define _IPC39_AD1D52IS_MASK                     0x00030000
#define _IPC39_AD1D52IS_LENGTH                   0x00000002

#define _IPC39_AD1D52IP_POSITION                 0x00000012
#define _IPC39_AD1D52IP_MASK                     0x001C0000
#define _IPC39_AD1D52IP_LENGTH                   0x00000003

#define _IPC39_AD1D53IS_POSITION                 0x00000018
#define _IPC39_AD1D53IS_MASK                     0x03000000
#define _IPC39_AD1D53IS_LENGTH                   0x00000002

#define _IPC39_AD1D53IP_POSITION                 0x0000001A
#define _IPC39_AD1D53IP_MASK                     0x1C000000
#define _IPC39_AD1D53IP_LENGTH                   0x00000003

#define _IPC39_w_POSITION                        0x00000000
#define _IPC39_w_MASK                            0xFFFFFFFF
#define _IPC39_w_LENGTH                          0x00000020

#define _IPC40_CMP3IS_POSITION                   0x00000000
#define _IPC40_CMP3IS_MASK                       0x00000003
#define _IPC40_CMP3IS_LENGTH                     0x00000002

#define _IPC40_CMP3IP_POSITION                   0x00000002
#define _IPC40_CMP3IP_MASK                       0x0000001C
#define _IPC40_CMP3IP_LENGTH                     0x00000003

#define _IPC40_CMP4IS_POSITION                   0x00000008
#define _IPC40_CMP4IS_MASK                       0x00000300
#define _IPC40_CMP4IS_LENGTH                     0x00000002

