Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk100.h
#define _CNPDA_CNPDA14_POSITION                  0x0000000E
#define _CNPDA_CNPDA14_MASK                      0x00004000
#define _CNPDA_CNPDA14_LENGTH                    0x00000001

#define _CNPDA_CNPDA15_POSITION                  0x0000000F
#define _CNPDA_CNPDA15_MASK                      0x00008000
#define _CNPDA_CNPDA15_LENGTH                    0x00000001

#define _CNPDA_w_POSITION                        0x00000000
#define _CNPDA_w_MASK                            0xFFFFFFFF
#define _CNPDA_w_LENGTH                          0x00000020

#define _CNCONA_EDGEDETECT_POSITION              0x0000000B
#define _CNCONA_EDGEDETECT_MASK                  0x00000800
#define _CNCONA_EDGEDETECT_LENGTH                0x00000001

#define _CNCONA_ON_POSITION                      0x0000000F
#define _CNCONA_ON_MASK                          0x00008000
#define _CNCONA_ON_LENGTH                        0x00000001

#define _CNCONA_w_POSITION                       0x00000000
#define _CNCONA_w_MASK                           0xFFFFFFFF
#define _CNCONA_w_LENGTH                         0x00000020

#define _CNENA_CNIEA0_POSITION                   0x00000000
#define _CNENA_CNIEA0_MASK                       0x00000001
#define _CNENA_CNIEA0_LENGTH                     0x00000001

#define _CNENA_CNIEA1_POSITION                   0x00000001
#define _CNENA_CNIEA1_MASK                       0x00000002
#define _CNENA_CNIEA1_LENGTH                     0x00000001

#define _CNENA_CNIEA4_POSITION                   0x00000004
#define _CNENA_CNIEA4_MASK                       0x00000010
#define _CNENA_CNIEA4_LENGTH                     0x00000001

#define _CNENA_CNIEA7_POSITION                   0x00000007
#define _CNENA_CNIEA7_MASK                       0x00000080
#define _CNENA_CNIEA7_LENGTH                     0x00000001

#define _CNENA_CNIEA8_POSITION                   0x00000008
#define _CNENA_CNIEA8_MASK                       0x00000100
#define _CNENA_CNIEA8_LENGTH                     0x00000001

#define _CNENA_CNIEA10_POSITION                  0x0000000A
#define _CNENA_CNIEA10_MASK                      0x00000400
#define _CNENA_CNIEA10_LENGTH                    0x00000001

#define _CNENA_CNIEA11_POSITION                  0x0000000B
#define _CNENA_CNIEA11_MASK                      0x00000800
#define _CNENA_CNIEA11_LENGTH                    0x00000001

#define _CNENA_CNIEA12_POSITION                  0x0000000C
#define _CNENA_CNIEA12_MASK                      0x00001000
#define _CNENA_CNIEA12_LENGTH                    0x00000001

#define _CNENA_CNIEA14_POSITION                  0x0000000E
#define _CNENA_CNIEA14_MASK                      0x00004000
#define _CNENA_CNIEA14_LENGTH                    0x00000001

#define _CNENA_CNIEA15_POSITION                  0x0000000F
#define _CNENA_CNIEA15_MASK                      0x00008000
#define _CNENA_CNIEA15_LENGTH                    0x00000001

#define _CNENA_w_POSITION                        0x00000000
#define _CNENA_w_MASK                            0xFFFFFFFF
#define _CNENA_w_LENGTH                          0x00000020

#define _CNSTATA_CNSTATA0_POSITION               0x00000000
#define _CNSTATA_CNSTATA0_MASK                   0x00000001
#define _CNSTATA_CNSTATA0_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA1_POSITION               0x00000001
#define _CNSTATA_CNSTATA1_MASK                   0x00000002
#define _CNSTATA_CNSTATA1_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA4_POSITION               0x00000004
#define _CNSTATA_CNSTATA4_MASK                   0x00000010
#define _CNSTATA_CNSTATA4_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA7_POSITION               0x00000007
#define _CNSTATA_CNSTATA7_MASK                   0x00000080
#define _CNSTATA_CNSTATA7_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA8_POSITION               0x00000008
#define _CNSTATA_CNSTATA8_MASK                   0x00000100
#define _CNSTATA_CNSTATA8_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA10_POSITION              0x0000000A
#define _CNSTATA_CNSTATA10_MASK                  0x00000400
#define _CNSTATA_CNSTATA10_LENGTH                0x00000001

#define _CNSTATA_CNSTATA11_POSITION              0x0000000B
#define _CNSTATA_CNSTATA11_MASK                  0x00000800
#define _CNSTATA_CNSTATA11_LENGTH                0x00000001

#define _CNSTATA_CNSTATA12_POSITION              0x0000000C
#define _CNSTATA_CNSTATA12_MASK                  0x00001000
#define _CNSTATA_CNSTATA12_LENGTH                0x00000001

#define _CNSTATA_CNSTATA14_POSITION              0x0000000E
#define _CNSTATA_CNSTATA14_MASK                  0x00004000
#define _CNSTATA_CNSTATA14_LENGTH                0x00000001

#define _CNSTATA_CNSTATA15_POSITION              0x0000000F
#define _CNSTATA_CNSTATA15_MASK                  0x00008000
#define _CNSTATA_CNSTATA15_LENGTH                0x00000001

#define _CNSTATA_w_POSITION                      0x00000000
#define _CNSTATA_w_MASK                          0xFFFFFFFF
#define _CNSTATA_w_LENGTH                        0x00000020

#define _CNNEA_CNNEA0_POSITION                   0x00000000
#define _CNNEA_CNNEA0_MASK                       0x00000001
#define _CNNEA_CNNEA0_LENGTH                     0x00000001

#define _CNNEA_CNNEA1_POSITION                   0x00000001
#define _CNNEA_CNNEA1_MASK                       0x00000002
#define _CNNEA_CNNEA1_LENGTH                     0x00000001

#define _CNNEA_CNNEA4_POSITION                   0x00000004
#define _CNNEA_CNNEA4_MASK                       0x00000010
#define _CNNEA_CNNEA4_LENGTH                     0x00000001

#define _CNNEA_CNNEA7_POSITION                   0x00000007
#define _CNNEA_CNNEA7_MASK                       0x00000080
#define _CNNEA_CNNEA7_LENGTH                     0x00000001

#define _CNNEA_CNNEA8_POSITION                   0x00000008
#define _CNNEA_CNNEA8_MASK                       0x00000100
#define _CNNEA_CNNEA8_LENGTH                     0x00000001

#define _CNNEA_CNNEA10_POSITION                  0x0000000A
#define _CNNEA_CNNEA10_MASK                      0x00000400
#define _CNNEA_CNNEA10_LENGTH                    0x00000001

#define _CNNEA_CNNEA11_POSITION                  0x0000000B
#define _CNNEA_CNNEA11_MASK                      0x00000800
#define _CNNEA_CNNEA11_LENGTH                    0x00000001

#define _CNNEA_CNNEA12_POSITION                  0x0000000C
#define _CNNEA_CNNEA12_MASK                      0x00001000
#define _CNNEA_CNNEA12_LENGTH                    0x00000001

