Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk100.h
#define _U2EP6_EPTXEN_POSITION                   0x00000002
#define _U2EP6_EPTXEN_MASK                       0x00000004
#define _U2EP6_EPTXEN_LENGTH                     0x00000001

#define _U2EP6_EPRXEN_POSITION                   0x00000003
#define _U2EP6_EPRXEN_MASK                       0x00000008
#define _U2EP6_EPRXEN_LENGTH                     0x00000001

#define _U2EP6_EPCONDIS_POSITION                 0x00000004
#define _U2EP6_EPCONDIS_MASK                     0x00000010
#define _U2EP6_EPCONDIS_LENGTH                   0x00000001

#define _U2EP7_EPHSHK_POSITION                   0x00000000
#define _U2EP7_EPHSHK_MASK                       0x00000001
#define _U2EP7_EPHSHK_LENGTH                     0x00000001

#define _U2EP7_EPSTALL_POSITION                  0x00000001
#define _U2EP7_EPSTALL_MASK                      0x00000002
#define _U2EP7_EPSTALL_LENGTH                    0x00000001

#define _U2EP7_EPTXEN_POSITION                   0x00000002
#define _U2EP7_EPTXEN_MASK                       0x00000004
#define _U2EP7_EPTXEN_LENGTH                     0x00000001

#define _U2EP7_EPRXEN_POSITION                   0x00000003
#define _U2EP7_EPRXEN_MASK                       0x00000008
#define _U2EP7_EPRXEN_LENGTH                     0x00000001

#define _U2EP7_EPCONDIS_POSITION                 0x00000004
#define _U2EP7_EPCONDIS_MASK                     0x00000010
#define _U2EP7_EPCONDIS_LENGTH                   0x00000001

#define _U2EP8_EPHSHK_POSITION                   0x00000000
#define _U2EP8_EPHSHK_MASK                       0x00000001
#define _U2EP8_EPHSHK_LENGTH                     0x00000001

#define _U2EP8_EPSTALL_POSITION                  0x00000001
#define _U2EP8_EPSTALL_MASK                      0x00000002
#define _U2EP8_EPSTALL_LENGTH                    0x00000001

#define _U2EP8_EPTXEN_POSITION                   0x00000002
#define _U2EP8_EPTXEN_MASK                       0x00000004
#define _U2EP8_EPTXEN_LENGTH                     0x00000001

#define _U2EP8_EPRXEN_POSITION                   0x00000003
#define _U2EP8_EPRXEN_MASK                       0x00000008
#define _U2EP8_EPRXEN_LENGTH                     0x00000001

#define _U2EP8_EPCONDIS_POSITION                 0x00000004
#define _U2EP8_EPCONDIS_MASK                     0x00000010
#define _U2EP8_EPCONDIS_LENGTH                   0x00000001

#define _U2EP9_EPHSHK_POSITION                   0x00000000
#define _U2EP9_EPHSHK_MASK                       0x00000001
#define _U2EP9_EPHSHK_LENGTH                     0x00000001

#define _U2EP9_EPSTALL_POSITION                  0x00000001
#define _U2EP9_EPSTALL_MASK                      0x00000002
#define _U2EP9_EPSTALL_LENGTH                    0x00000001

#define _U2EP9_EPTXEN_POSITION                   0x00000002
#define _U2EP9_EPTXEN_MASK                       0x00000004
#define _U2EP9_EPTXEN_LENGTH                     0x00000001

#define _U2EP9_EPRXEN_POSITION                   0x00000003
#define _U2EP9_EPRXEN_MASK                       0x00000008
#define _U2EP9_EPRXEN_LENGTH                     0x00000001

#define _U2EP9_EPCONDIS_POSITION                 0x00000004
#define _U2EP9_EPCONDIS_MASK                     0x00000010
#define _U2EP9_EPCONDIS_LENGTH                   0x00000001

#define _U2EP10_EPHSHK_POSITION                  0x00000000
#define _U2EP10_EPHSHK_MASK                      0x00000001
#define _U2EP10_EPHSHK_LENGTH                    0x00000001

#define _U2EP10_EPSTALL_POSITION                 0x00000001
#define _U2EP10_EPSTALL_MASK                     0x00000002
#define _U2EP10_EPSTALL_LENGTH                   0x00000001

#define _U2EP10_EPTXEN_POSITION                  0x00000002
#define _U2EP10_EPTXEN_MASK                      0x00000004
#define _U2EP10_EPTXEN_LENGTH                    0x00000001

#define _U2EP10_EPRXEN_POSITION                  0x00000003
#define _U2EP10_EPRXEN_MASK                      0x00000008
#define _U2EP10_EPRXEN_LENGTH                    0x00000001

#define _U2EP10_EPCONDIS_POSITION                0x00000004
#define _U2EP10_EPCONDIS_MASK                    0x00000010
#define _U2EP10_EPCONDIS_LENGTH                  0x00000001

#define _U2EP11_EPHSHK_POSITION                  0x00000000
#define _U2EP11_EPHSHK_MASK                      0x00000001
#define _U2EP11_EPHSHK_LENGTH                    0x00000001

#define _U2EP11_EPSTALL_POSITION                 0x00000001
#define _U2EP11_EPSTALL_MASK                     0x00000002
#define _U2EP11_EPSTALL_LENGTH                   0x00000001

#define _U2EP11_EPTXEN_POSITION                  0x00000002
#define _U2EP11_EPTXEN_MASK                      0x00000004
#define _U2EP11_EPTXEN_LENGTH                    0x00000001

#define _U2EP11_EPRXEN_POSITION                  0x00000003
#define _U2EP11_EPRXEN_MASK                      0x00000008
#define _U2EP11_EPRXEN_LENGTH                    0x00000001

#define _U2EP11_EPCONDIS_POSITION                0x00000004
#define _U2EP11_EPCONDIS_MASK                    0x00000010
#define _U2EP11_EPCONDIS_LENGTH                  0x00000001

#define _U2EP12_EPHSHK_POSITION                  0x00000000
#define _U2EP12_EPHSHK_MASK                      0x00000001
#define _U2EP12_EPHSHK_LENGTH                    0x00000001

#define _U2EP12_EPSTALL_POSITION                 0x00000001
#define _U2EP12_EPSTALL_MASK                     0x00000002
#define _U2EP12_EPSTALL_LENGTH                   0x00000001

#define _U2EP12_EPTXEN_POSITION                  0x00000002
#define _U2EP12_EPTXEN_MASK                      0x00000004
#define _U2EP12_EPTXEN_LENGTH                    0x00000001

#define _U2EP12_EPRXEN_POSITION                  0x00000003
#define _U2EP12_EPRXEN_MASK                      0x00000008
#define _U2EP12_EPRXEN_LENGTH                    0x00000001

#define _U2EP12_EPCONDIS_POSITION                0x00000004
#define _U2EP12_EPCONDIS_MASK                    0x00000010
#define _U2EP12_EPCONDIS_LENGTH                  0x00000001

#define _U2EP13_EPHSHK_POSITION                  0x00000000
#define _U2EP13_EPHSHK_MASK                      0x00000001
#define _U2EP13_EPHSHK_LENGTH                    0x00000001

#define _U2EP13_EPSTALL_POSITION                 0x00000001
#define _U2EP13_EPSTALL_MASK                     0x00000002
#define _U2EP13_EPSTALL_LENGTH                   0x00000001

#define _U2EP13_EPTXEN_POSITION                  0x00000002
#define _U2EP13_EPTXEN_MASK                      0x00000004
#define _U2EP13_EPTXEN_LENGTH                    0x00000001

#define _U2EP13_EPRXEN_POSITION                  0x00000003
#define _U2EP13_EPRXEN_MASK                      0x00000008
#define _U2EP13_EPRXEN_LENGTH                    0x00000001

